---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ValueOutOfRange
source: html/dbbe3f55-2d4b-05b5-f4d8-a75f4a81aab7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ValueOutOfRange Property

Value is out of range ! Please enter a number between [Value] and [Value].

## Syntax (C#)
```csharp
public static FailureDefinitionId ValueOutOfRange { get; }
```